In [225]:
pip install pymysql

Collecting pymysql
  Using cached pymysql-1.1.2-py3-none-any.whl.metadata (4.3 kB)
Using cached pymysql-1.1.2-py3-none-any.whl (45 kB)
Installing collected packages: pymysql
Successfully installed pymysql-1.1.2
Note: you may need to restart the kernel to use updated packages.

In [3]:
import pandas as pd
df=pd.read_excel("Sales.xlsx")
df.head()

   Order_ID           Order_Date Customer Region  Product  Sales   Cost
0      1001            1/13/2023    Rohit  South   Mobile  23289  19118
1      1002  2023-07-10 00:00:00     Aman   West   Laptop   8905   5593
2      1003  2023-05-11 00:00:00    Rahul  South  Monitor  59987  39959
3      1004            2/19/2024    Rahul  South  Printer  49597  33892
4      1005            1/26/2024   Anjali  North   Laptop  54797  34468

In [4]:
df.duplicated().sum()

np.int64(20)

In [5]:
#duplicate remove
df=df.drop_duplicates()
df.shape

(500, 7)

In [6]:
df.isnull().sum()

Order_ID       0
Order_Date    18
Customer       0
Region         0
Product        0
Sales          0
Cost           0
dtype: int64

In [7]:
df['Order_ID'].dtype

dtype('int64')

In [8]:
df['Order_ID'].nunique()

500

In [9]:
df.count()

Order_ID      500
Order_Date    482
Customer      500
Region        500
Product       500
Sales         500
Cost          500
dtype: int64

In [10]:
print(df['Order_ID'].count())

500

In [11]:
#fix date 

# Convert to datetime first
df['Order_Date'] = pd.to_datetime(df['Order_Date'])

In [12]:
# Keep only the date part
df['Order_Date'] = df['Order_Date'].dt.date

In [14]:
df['Order_Date'].dtype

dtype('O')

In [15]:
df=df.dropna(subset=['Order_Date'])

In [16]:
df.isnull().sum()

Order_ID      0
Order_Date    0
Customer      0
Region        0
Product       0
Sales         0
Cost          0
dtype: int64

In [17]:
df['Order_Date']=pd.to_datetime(df['Order_Date'],errors="coerce")

In [18]:
df.iloc[413:418]

     Order_ID Order_Date Customer Region Product  Sales   Cost
429      1430 2023-05-08     Neha   West  Laptop  35008  25027
430      1431 2023-02-22     Aman   East  Tablet  44223  28353
431      1432 2024-01-21     Neha  South  Laptop  74534  57315
432      1433 2023-03-26    Pooja   East  Mobile  24840  21759
433      1434 2023-08-15    Priya  North  Laptop  23351  19281

In [19]:
df["Profit"]=df["Sales"]-df["Cost"]
df["Year"]=df["Order_Date"].dt.year
df["Month"]=df["Order_Date"].dt.month_name()

In [20]:
df.head()

,Order_ID,Order_Date,Customer,Region,Product,Sales,Cost,Profit,Year,Month
0,1001,2023-01-13,Rohit,South,Mobile,23289,19118,4171,2023,January
1,1002,2023-07-10,Aman,West,Laptop,8905,5593,3312,2023,July
2,1003,2023-05-11,Rahul,South,Monitor,59987,39959,20028,2023,May
3,1004,2024-02-19,Rahul,South,Printer,49597,33892,15705,2024,February
4,1005,2024-01-26,Anjali,North,Laptop,54797,34468,20329,2024,January

In [214]:
df=df.drop('Month',axis=1)

In [21]:
df.to_excel("Sales_Cleanned.xlsx", index=False)

### ** Data python + Excel + +SQL**

In [22]:
import pandas as pd 
from sqlalchemy import create_engine

In [23]:
df=pd.read_excel("Sales_Cleanned.xlsx")

In [24]:
df.head()

,Order_ID,Order_Date,Customer,Region,Product,Sales,Cost,Profit,Year,Month
0,1001,2023-01-13,Rohit,South,Mobile,23289,19118,4171,2023,January
1,1002,2023-07-10,Aman,West,Laptop,8905,5593,3312,2023,July
2,1003,2023-05-11,Rahul,South,Monitor,59987,39959,20028,2023,May
3,1004,2024-02-19,Rahul,South,Printer,49597,33892,15705,2024,February
4,1005,2024-01-26,Anjali,North,Laptop,54797,34468,20329,2024,January

In [25]:
engine=create_engine('mysql+pymysql://root:Sahil%401212@127.0.0.1:3306/salesdb')

In [26]:
df.to_sql(name='Sales_data',con=engine,if_exists='replace',index=False)

C:\Users\Admin\AppData\Local\Temp\ipykernel_18820\3221677391.py:1: UserWarning: The provided table name 'Sales_data' is not found exactly as such in the database after writing the table, possibly due to case sensitivity issues. Consider using lower case table names.
  df.to_sql(name='Sales_data',con=engine,if_exists='replace',index=False)

482